read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/PC.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/Imem.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/Control.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/Regfile.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/ALU.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/Dmem.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/BrUnit.v
read_verilog -sv -formal -overwrite {workspace}/CPU_Pipeline.srcs/sources_1/new/TopCpu.v
design -reset-vlog; proc;
write_json {workspace}/netlist/TopCpu.json